app/views/posts/index.html.erb

             <p><%= time_ago_in_words post.created_at %> ago</p>
             <p><%= post.comments.count %> comments</p>
---
SELECT COUNT(*) FROM "comments"  WHERE "comments"."post_id" = $1  [["post_id", 1]]