app/controllers/associates_controller.rb

SELECT "associates".* FROM "associates"
---
  def index
    @associates = Associate.all

INSERT INTO "associates" ("contact_add", "created_at", "dob", "email", "hobbies", "other_certificate", "other_date", "other_institution", "other_names", "personal_statement", "sec_certificate", "sec_date", "sec_institution", "surname", "telephone", "uni_certificate", "uni_date", "uni_institution", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"
---
  def create
    @associate = Associate.new(associate_params)

    respond_to do |format|
      if @associate.save

UPDATE "associates" SET "email" = $1, "updated_at" = $2 WHERE "associates"."id" = 1  [["email", "habbeboy@gmail.com"], ["updated_at", "2016-04-29 23:44:35.448932"]]
---
  def update
    respond_to do |format|
      if @associate.update(associate_params)

SELECT  "associates".* FROM "associates"  WHERE "associates"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_associate
      @associate = Associate.find(params[:id])