app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("comment", "created_at", "post_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "hello world is the status for getting started"], ["created_at", "2016-04-29 22:51:15.426317"], ["post_id", 1], ["updated_at", "2016-04-29 22:51:15.426317"]]
---
  def create
  	@post = Post.find(params[:post_id])
  	@comment = @post.comments.build(comment_params)
  	@comment.save