app/controllers/consultants_controller.rb

SELECT "consultants".* FROM "consultants"
---
  def index
    @consultants = Consultant.all

INSERT INTO "consultants" ("area_of_interest", "company_business", "company_name", "contact_add", "created_at", "dob", "email", "hobbies", "other_certificate", "other_date", "other_institution", "other_names", "personal_statement", "registered", "registration_details", "sec_certificate", "sec_date", "sec_institution", "surname", "telephone", "uni_certificate", "uni_date", "uni_institution", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24) RETURNING "id"
---
  def create
    @consultant = Consultant.new(consultant_params)

    respond_to do |format|
      if @consultant.save

SELECT  "consultants".* FROM "consultants"  WHERE "consultants"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_consultant
      @consultant = Consultant.find(params[:id])