app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("author_name", "created_at", "message", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"